{
    "header": {
      "welcome": "Welcome",
      "switchThemeDark": "Switch to Dark",
      "switchThemeLight": "Switch to Light",
      "language": "Language"
    },
    "maincontent": {
        "contact": {
            "tag": "Contact Information",
            "name": {
                "name": "Name",
                "value": "Kurosaki Ichigo"
            },
            "number": {
                "number": "Tel",
                "value": "0000-00000-00000"
            },
            "email": {
                "email": "E-mail",
                "value": "test@test.com"
            },
            "github": {
                "github": "Github",
                "value": "www.github.com/test"
            },
            "linkedIn": {
                "linkedIn": "LinkedIn",
                "value": "www.linkedIn.com"
            },
            "residency": {
                "residency": "Residence",
                "country": "Japan",
                "prefecture": "Tokyo",
                "city": "Tokyo"
            }
        },

        "summary": {
            "tag": "SUMMARY",
            "description": "Experienced full-stack developer with a broad skill set ranging from web-based systems to Android applications. With a deep interest in backend development, I focus on API design, server deployment, and optimizing system performance. I am now seeking to specialize in backend development, leveraging my experience to build scalable, efficient systems that meet the needs of modern applications."       
        },
        "skills": {
            "tag": "SKILLS",
            "frontend": {
                "category": "Front End:",
                "technologies": "Typescript, React, HTML, CSS, Tailwind."
            },
            "backend": {
                "category": "Backend:",
                "technologies": "NodeJS, Python, Java, ExpressJS"
            },
            "deployment": {
                "category": "Deployment:",
                "technologies": "Linux Server, Linux, Docker."
            },
            "languages":{
                "category": "Languages:",
                "technologies": "Japanese, English, Russian, Kyryz, Uzbek"
            }
        },
        "about-me": {
            "tag": "ABOUT ME",
            "description": "I've had the chance to explore a wide range of technologies, from frontend development to full-stack projects and mobile apps, but backend development has always been my true passion. I love diving deep into complex algorithms like quicksort and others, finding immense satisfaction when everything falls into place and runs efficiently. Whether it’s optimizing performance or structuring APIs, there’s nothing quite like the feeling of seeing well-designed code work seamlessly. Now, I’m fully committed to growing as a backend specialist, building on the diverse experiences I've gained to master the art of crafting scalable and reliable systems."
        },
        "experience": {
            "tag": "EXPERIENCE",
            "experiences": [{
                "position": "Internship as a Sofware Engineer",
                "workplace": "U",
                "location": "Ibaraki",
                "period": "May 2022 - December 2022",
                "tasks": [{
                    "task": "Contributed to code refactoring for enhanced maintainability and code quality."
                },
                {
                    "task": "Assisted in website layout design, emphasizing responsive and user-friendly interfaces."
                },
                {
                    "task": "Debugged and resolved issues, improving the overall system reliability."
                }]
            },
            {
                "position": "Software Engineer",
                "workplace": "U",
                "location": "Ibaraki",
                "period": "January 2023 - Present",
                "tasks": [{
                    "task": "Refactored and optimized the codebase of an online meeting and video call app, improving performance and maintainability."
                },
                {
                    "task": "Spearheaded the creation and maintenance of Docker containers for smooth deployment processes."
                },
                {
                    "task": "Developed backend infrastructure for a delivery robot Android application, ensuring system integration and seamless operation."
                },
                {
                    "task": "Collaborated with design and QA teams to deliver high-quality products on time."
                },
                {
                    "task": "Reduced user churn by 20% by fixing critical bugs in the online meeting app."
                },
                {
                    "task": "Technologies: Docker, Git, Backlog, Android, VR, RESTful APIs, PostgreSQL, A-Frame, Java, Python, NodeJS, Express, TypeScript"
                }
            ]
            }]
        },
        "projects": {
            "tag": "PROJECTS",
            "projects": [{
                "title": "Android Application for Food Delivery Robot",
                "description": "Developed an Android application in Java to manage a food delivery robot’s operations and task scheduling."
            },
            {
                "title": "Docker Environment Setup for Computer Vision System",
                "description": "Configured a Docker environment to launch the entire computer vision system for side sensor analysis."
            },
             {
                "title": "Website Refactoring and Optimization (TypeScript & React)",
                "description": "Refactored a website’s front end using TypeScript and React, improving performance and maintainability."
            },
            {
                "title": "API Backend Development with NodeJS and Express",
                "description": "Built a robust backend to handle API requests, improving the efficiency of website-server interactions."
            },
            {
                "title": "Order Automation System Extension (Ruby on Rails)",
                "description": "Enhanced an order automation system by adding new functionalities and refining existing features."
            },
            {
                "title": "Web-Based TimeShare Reservation System",
                "description": "Developed a reservation system with secure JWT token authentication for web-based bookings service for online meetings."
            }]
        },
        "education": {
            "tag": "EDUCATION",
            "bachelor": {
                "degree" : "Bachelor degree",
                "place": "Bishkek State University",
                "date": ""
            },
            "magister": {
                "degree" : "Magister degree",
                "place": "Ibaraki Cristian University"
            } 
        },
        "certification": {
            "tag": "CERTIFICATIONS",
            "certifications": [{
                "title": "Japanese-Language Proficiency Test",
                "level": "N2"
            }]
        }
    },
    "footer": {
        "title": "Created using Tailwind CSS, Shadcn/ui, Heroicons, TypeScript, and React"
    }
}